Revit 2024 API
NumberingSchemaType Members
The NumberingSchemaType type exposes the following members.
Constructors
Name | Description
NumberingSchemaType
Creates a new NumberingSchemaType instance.
Methods
Name | Description
Equals
 Compares two Guid-based enum object based on their concrete class and GUID value.
 (Inherited from GuidEnum.)
GetHashCode
 Generates a hash code for this Guid-based enum object.
 (Inherited from GuidEnum.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Operators
Name | Description
Equality
Compares two NumberingSchemaType instances.
Inequality
Compares two NumberingSchemaType instances.
Properties
Name | Description
Guid
 The Guid of GUID-based enum object.
 (Inherited from GuidEnum.)
See Also
NumberingSchemaType Class
Autodesk.Revit.DB Namespace